ETHZ-TEC/BOLT/driverlib/MSP430FR5xx_6xx/deprecated/cs.c
        // Unlock CS control register
    HWREG16(baseAddress + OFS_CSCTL0) = CSKEY;

    switch (selectedClockSignal){
        case CS_ACLK:
                assert(
                    (CS_LFXTCLK_SELECT == clockSource)  ||
                    (CS_VLOCLK_SELECT == clockSource)   ||
                    (CS_LFMODOSC_SELECT == clockSource)
                    );

            clockSourceDivider = clockSourceDivider << 8;
            clockSource = clockSource << 8;

            HWREG16(baseAddress + OFS_CSCTL2) &= ~(SELA_7);
            HWREG16(baseAddress + OFS_CSCTL2) |= (clockSource);
            HWREG16(baseAddress + OFS_CSCTL3) &= ~(DIVA0 + DIVA1 + DIVA2);
            HWREG16(baseAddress + OFS_CSCTL3) |= clockSourceDivider;
            break;
        case CS_SMCLK:
            assert(
                (CS_LFXTCLK_SELECT == clockSource) ||
                (CS_VLOCLK_SELECT == clockSource) ||
                (CS_DCOCLK_SELECT == clockSource) ||
                (CS_HFXTCLK_SELECT == clockSource) ||
                (CS_LFMODOSC_SELECT== clockSource)||
                (CS_MODOSC_SELECT == clockSource)
                );

            clockSource = clockSource << 4;
            clockSourceDivider = clockSourceDivider << 4;

            HWREG16(baseAddress + OFS_CSCTL2) &= ~(SELS_7);
            HWREG16(baseAddress + OFS_CSCTL2) |= clockSource;
            HWREG16(baseAddress + OFS_CSCTL3) &= ~(DIVS0 + DIVS1 + DIVS2);
            HWREG16(baseAddress + OFS_CSCTL3) |= clockSourceDivider;
            break;
        case CS_MCLK:
            assert(
            (CS_LFXTCLK_SELECT == clockSource) ||
            (CS_VLOCLK_SELECT == clockSource) ||
            (CS_DCOCLK_SELECT == clockSource) ||
            (CS_HFXTCLK_SELECT == clockSource) ||
            (CS_LFMODOSC_SELECT== clockSource)||
            (CS_MODOSC_SELECT == clockSource)
            );

            HWREG16(baseAddress + OFS_CSCTL2) &= ~(SELM_7);
            HWREG16(baseAddress + OFS_CSCTL2) |= clockSource;
            HWREG16(baseAddress + OFS_CSCTL3) &= ~(DIVM0 + DIVM1 + DIVM2);
            HWREG16(baseAddress + OFS_CSCTL3) |= clockSourceDivider;
            break;
    }

    // Lock CS control register
    HWREG8(baseAddress + OFS_CSCTL0_H) = 0x00;
}

//*****************************************************************************
//
//! \brief Initializes the LFXT crystal in low frequency mode.
//!
//! Initializes the LFXT crystal oscillator in low frequency mode. Loops until
//! all oscillator fault flags are cleared, with no timeout. See the device-
//! specific data sheet for appropriate drive settings. IMPORTANT: User must
//! call CS_setExternalClockSource function to set frequency of external clocks
//! this function is call.
//!
//! \param baseAddress is the base address of the CS module.
//! \param lfxtdrive is the target drive strength for the LFXT crystal
//!        oscillator.
//!        Valid values are:
//!        - \b CS_LFXT_DRIVE0
//!        - \b CS_LFXT_DRIVE1
//!        - \b CS_LFXT_DRIVE2
//!        - \b CS_LFXT_DRIVE3 [Default]
//!
//! Modified bits of \b CSCTL0 register, bits of \b CSCTL5 register, bits of \b
//! CSCTL4 register and bits of \b SFRIFG1 register.
//!
//! \return None
//
//*****************************************************************************
void CS_LFXTStart ( uint32_t baseAddress,
    uint16_t lfxtdrive
    )
{
    assert(CS_LFXTClockFrequency !=0);

        assert((lfxtdrive == CS_LFXT_DRIVE0 ) ||
            (lfxtdrive == CS_LFXT_DRIVE1 ) ||
            (lfxtdrive == CS_LFXT_DRIVE2 ) ||
            (lfxtdrive == CS_LFXT_DRIVE3 ));

        // Unlock CS control register
        HWREG16(baseAddress + OFS_CSCTL0) = CSKEY;

        //If the drive setting is not already set to maximum
        //Set it to max for LFXT startup
        if ((HWREG16(baseAddress + OFS_CSCTL4) & LFXTDRIVE_3) != LFXTDRIVE_3){
            //Highest drive setting for LFXTstartup
            HWREG16(baseAddress + OFS_CSCTL4_L) |= LFXTDRIVE1_L + LFXTDRIVE0_L;
        }

        HWREG16(baseAddress + OFS_CSCTL4) &= ~LFXTBYPASS;

        //Wait for Crystal to stabilize
        while (HWREG8(baseAddress + OFS_CSCTL5) & LFXTOFFG)
        {
            //Clear OSC flaut Flags fault flags
            HWREG8(baseAddress + OFS_CSCTL5) &= ~(LFXTOFFG);

            //Clear OFIFG fault flag
            HWREG8(SFR_BASE + OFS_SFRIFG1) &= ~OFIFG;
        }

        //set requested Drive mode
        HWREG16(baseAddress + OFS_CSCTL4) = ( HWREG16(baseAddress + OFS_CSCTL4) &
                                             ~(LFXTDRIVE_3)
                                             ) |
                                           (lfxtdrive);

        //Switch ON LFXT oscillator
        HWREG16(baseAddress + OFS_CSCTL4) &= ~LFXTOFF;

        // Lock CS control register
        HWREG8(baseAddress + OFS_CSCTL0_H) = 0x00;

}

//*****************************************************************************
//
//! \brief Bypasses the LFXT crystal oscillator.
//!
//! Bypasses the LFXT crystal oscillator. Loops until all oscillator fault
//! flags are cleared, with no timeout. IMPORTANT: User must call
//! CS_setExternalClockSource function to set frequency of external clocks this
//! function is call.
//!
//! \param baseAddress is the base address of the CS module.
//!
//! Modified bits of \b CSCTL0 register, bits of \b CSCTL5 register, bits of \b
//! CSCTL4 register and bits of \b SFRIFG register.
//!
//! \return None
//
//*****************************************************************************
void CS_bypassLFXT ( uint32_t baseAddress)
{
    //Verify user has set frequency of LFXT with SetExternalClockSource
    assert(CS_LFXTClockFrequency!=0);

    // Unlock CS control register
    HWREG16(baseAddress + OFS_CSCTL0) = CSKEY;

    assert(CS_LFXTClockFrequency<LFXT_FREQUENCY_THRESHOLD);

    // Set LFXT in LF mode Switch off LFXT oscillator and enable BYPASS mode
    HWREG16(baseAddress + OFS_CSCTL4) |= (LFXTBYPASS + LFXTOFF);

    //Wait until LFXT stabilizes
    while (HWREG8(baseAddress + OFS_CSCTL5) & LFXTOFFG)
    {
        //Clear OSC flaut Flags fault flags
        HWREG8(baseAddress + OFS_CSCTL5) &= ~(LFXTOFFG);

        // Clear the global fault flag. In case the LFXT caused the global fault
        // flag to get set this will clear the global error condition. If any
        // error condition persists, global flag will get again.
        HWREG8(SFR_BASE + OFS_SFRIFG1) &= ~OFIFG;
    }

    // Lock CS control register
    HWREG8(baseAddress + OFS_CSCTL0_H) = 0x00;
}

//*****************************************************************************
//
//! \brief Initializes the LFXT crystal oscillator in low frequency mode with
//! timeout.
//!
//! Initializes the LFXT crystal oscillator in low frequency mode with timeout.
//! Loops until all oscillator fault flags are cleared or until a timeout
//! counter is decremented and equals to zero. See the device-specific
//! datasheet for appropriate drive settings. IMPORTANT: User must call
//! CS_setExternalClockSource to set frequency of external clocks before
//! calling this function.
//!
//! \param baseAddress is the base address of the CS module.
//! \param lfxtdrive is the target drive strength for the LFXT crystal
//!        oscillator.
//!        Valid values are:
//!        - \b CS_LFXT_DRIVE0
//!        - \b CS_LFXT_DRIVE1
//!        - \b CS_LFXT_DRIVE2
//!        - \b CS_LFXT_DRIVE3 [Default]
//! \param timeout is the count value that gets decremented every time the loop
//!        that clears oscillator fault flags gets executed.
//!
//! Modified bits of \b CSCTL0 register, bits of \b CSCTL5 register, bits of \b
//! CSCTL4 register and bits of \b SFRIFG1 register.
//!
//! \return STATUS_SUCCESS or STATUS_FAIL indicating if the LFXT crystal
//!         oscillator was initialized successfully
//
//*****************************************************************************
bool CS_LFXTStartWithTimeout (uint32_t baseAddress,
        uint16_t lfxtdrive,
        uint32_t timeout
    )
{
    assert(CS_LFXTClockFrequency !=0);

    assert((lfxtdrive == CS_LFXT_DRIVE0 ) ||
        (lfxtdrive == CS_LFXT_DRIVE1 ) ||
        (lfxtdrive == CS_LFXT_DRIVE2 ) ||
        (lfxtdrive == CS_LFXT_DRIVE3 ));

    assert(timeout > 0);

