ETHZ-TEC/BOLT/driverlib/MSP430FR5xx_6xx/deprecated/cs.c
    // Unlock CS control register
    HWREG16(baseAddress + OFS_CSCTL0) = CSKEY;

    //If HFFrequency is 16MHz or above
    if (CS_HFXTClockFrequency>16000000) {
        HWREG16(baseAddress + OFS_CSCTL4)=HFFREQ_3;
    }
    //If HFFrequency is between 8MHz and 16MHz
    else if (CS_HFXTClockFrequency>8000000) {
        HWREG16(baseAddress + OFS_CSCTL4)=HFFREQ_2;
    }
    //If HFFrequency is between 0MHz and 4MHz
    else if (CS_HFXTClockFrequency<4000000) {
        HWREG16(baseAddress + OFS_CSCTL4)=HFFREQ_0;
    }
    //If HFFrequency is between 4MHz and 8MHz
    else{
        HWREG16(baseAddress + OFS_CSCTL4)=HFFREQ_1;
    }

    //Switch off HFXT oscillator and enable BYPASS mode
    HWREG16(baseAddress + OFS_CSCTL4) |= (HFXTBYPASS + HFXTOFF );

    while ((HWREG8(baseAddress + OFS_CSCTL5) & HFXTOFFG) && --timeout)
    {
        //Clear OSC fault Flags fault flags
        HWREG8(baseAddress + OFS_CSCTL5) &= ~(HFXTOFFG);

        // Clear the global fault flag. In case the LFXT caused the global fault
        // flag to get set this will clear the global error condition. If any
        // error condition persists, global flag will get again.
        HWREG8(SFR_BASE + OFS_SFRIFG1) &= ~OFIFG;

    }

    // Lock CS control register
    HWREG8(baseAddress + OFS_CSCTL0_H) = 0x00;

    if (timeout){
        return (STATUS_SUCCESS);
    } else   {
        return (STATUS_FAIL);
    }
}

//*****************************************************************************
//
//! \brief Stops the HFXT oscillator using the HFXTOFF bit.
//!
//! \param baseAddress is the base address of the CS module.
//!
//! Modified bits of \b CSCTL4 register.
//!
//! \return None
//
//*****************************************************************************
void CS_HFXTOff (uint32_t baseAddress)
{
    // Unlock CS control register
    HWREG16(baseAddress + OFS_CSCTL0) = CSKEY;

    //Switch off HFXT oscillator
    HWREG16(baseAddress + OFS_CSCTL4) |= HFXTOFF;

    // Lock CS control register
    HWREG8(baseAddress + OFS_CSCTL0_H) = 0x00;
}

//*****************************************************************************
//
//! \brief Enables conditional module requests
//!
//! \param baseAddress is the base address of the CS module.
//! \param selectClock selects specific request enables.
//!        Valid values are:
//!        - \b CS_ACLK
//!        - \b CS_MCLK
//!        - \b CS_SMCLK
//!        - \b CS_MODOSC
//!
//! Modified bits of \b CSCTL6 register.
//!
//! \return None
//
//*****************************************************************************
void CS_enableClockRequest (uint32_t baseAddress,
    uint8_t selectClock
    )
{
    assert(
            (CS_ACLK  == selectClock )||
            (CS_SMCLK == selectClock )||
            (CS_MCLK  == selectClock )||
            (CS_MODOSC== selectClock ));

    // Unlock CS control register
    HWREG16(baseAddress + OFS_CSCTL0) = CSKEY;

    HWREG8(baseAddress + OFS_CSCTL6) |= selectClock;

    // Lock CS control register
    HWREG8(baseAddress + OFS_CSCTL0_H) = 0x00;
}

//*****************************************************************************
//
//! \brief Disables conditional module requests
//!
//! \param baseAddress is the base address of the CS module.
//! \param selectClock selects specific request enables.
//!        Valid values are:
//!        - \b CS_ACLK
//!        - \b CS_MCLK
//!        - \b CS_SMCLK
//!        - \b CS_MODOSC
//!
//! Modified bits of \b CSCTL6 register.
//!
//! \return None
//
//*****************************************************************************
void CS_disableClockRequest (uint32_t baseAddress,
    uint8_t selectClock
    )
{
    assert(
            (CS_ACLK  == selectClock )||
            (CS_SMCLK == selectClock )||
            (CS_MCLK  == selectClock )||
            (CS_MODOSC== selectClock ));

    // Unlock CS control register
    HWREG16(baseAddress + OFS_CSCTL0) = CSKEY;

    HWREG8(baseAddress + OFS_CSCTL6) &= ~selectClock;

    // Lock CS control register
    HWREG8(baseAddress + OFS_CSCTL0_H) = 0x00;
}

//*****************************************************************************
//
//! \brief Gets the current CS fault flag status.
//!
//! \param baseAddress is the base address of the CS module.
//! \param mask is the masked interrupt flag status to be returned. Mask
//!        parameter can be either any of the following selection.
//!        Mask value is the logical OR of any of the following:
//!        - \b CS_LFXTOFFG - LFXT oscillator fault flag
//!        - \b CS_HFXTOFFG - HFXT oscillator fault flag
//!
//! \return Logical OR of any of the following:
//!         - \b CS_LFXTOFFG LFXT oscillator fault flag
//!         - \b CS_HFXTOFFG HFXT oscillator fault flag
//!         \n indicating the status of the masked interrupts
//
//*****************************************************************************
uint8_t CS_faultFlagStatus (uint32_t baseAddress,
    uint8_t mask
    )
{
    assert(
                (CS_HFXTOFFG  == mask )||
                (CS_LFXTOFFG == mask )
                );
    return (HWREG8(baseAddress + OFS_CSCTL5) & mask);
}

//*****************************************************************************
//
//! \brief Clears the current CS fault flag status for the masked bit.
//!
//! \param baseAddress is the base address of the CS module.
//! \param mask is the masked interrupt flag status to be returned. mask
//!        parameter can be any one of the following
//!        Mask value is the logical OR of any of the following:
//!        - \b CS_LFXTOFFG - LFXT oscillator fault flag
//!        - \b CS_HFXTOFFG - HFXT oscillator fault flag
//!
//! Modified bits of \b CSCTL5 register.
//!
//! \return None
//
//*****************************************************************************
void CS_clearFaultFlag (uint32_t baseAddress,
    uint8_t mask
    )
{
    assert(
            (CS_HFXTOFFG  == mask )||
            (CS_LFXTOFFG == mask )
            );

